In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-2.3.2-cp313-cp313-macosx_11_0_arm64.whl.metadata (91 kB)
Requirement already satisfied: numpy>=1.26.0 in /opt/miniconda3/lib/python3.13/site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/miniconda3/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /opt/miniconda3/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.2-cp313-cp313-macosx_11_0_arm64.whl (10.7 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 10.7/10.7 MB 1.1 MB/s eta 0:00:0000:0100:01
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3/3 [pandas]2m2/3 [pandas]
Successfully installed pandas-2.3.2 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd
ao = pd.Series([1,2,3,4,5,6], index = ['hi', 'me', 'you', 'other', 'every', 'Else'])
print(ao)

hi       1
me       2
you      3
other    4
every    5
Else     6
dtype: int64

In [2]:
data = {"kaarunya": 26, "lakshman":92, "cherry": 83}   #using dict
s3 = pd.Series(data)
print(s3)

kaarunya    26
lakshman    92
cherry      83
dtype: int64

In [3]:
 ao>4 #SIMILAR TO BOOLEAN INDEXING WHICH WE SAW IN NUMPY

hi       False
me       False
you      False
other    False
every     True
Else      True
dtype: bool

In [7]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
	 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 	 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

df1 = pd.DataFrame(data)
df1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [9]:
df1.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [12]:
df1.loc[2]

state    Ohio
year     2002
pop       3.6
Name: 2, dtype: object

In [20]:
import numpy as np
df1['men'] = np.array(range(1,7))
df1

    state  year  pop  men
0    Ohio  2000  1.5    1
1    Ohio  2001  1.7    2
2    Ohio  2002  3.6    3
3  Nevada  2001  2.4    4
4  Nevada  2002  2.9    5
5  Nevada  2003  3.2    6

In [24]:
df1['avg']= df1['men'] / df1['pop']
df1

    state  year  pop  men       avg
0    Ohio  2000  1.5    1  0.666667
1    Ohio  2001  1.7    2  1.176471
2    Ohio  2002  3.6    3  0.833333
3  Nevada  2001  2.4    4  1.666667
4  Nevada  2002  2.9    5  1.724138
5  Nevada  2003  3.2    6  1.875000

In [27]:
df1['estern'] = df1['state'] == 'Ohio'
df1                                           #SIMILAR TO BOOLEAN INDEXING

    state  year  pop  men       avg  estern
0    Ohio  2000  1.5    1  0.666667    True
1    Ohio  2001  1.7    2  1.176471    True
2    Ohio  2002  3.6    3  0.833333    True
3  Nevada  2001  2.4    4  1.666667   False
4  Nevada  2002  2.9    5  1.724138   False
5  Nevada  2003  3.2    6  1.875000   False

In [29]:
df1.T #the indexing going to coloumns

               0         1         2         3         4       5
state       Ohio      Ohio      Ohio    Nevada    Nevada  Nevada
year        2000      2001      2002      2001      2002    2003
pop          1.5       1.7       3.6       2.4       2.9     3.2
men            1         2         3         4         5       6
avg     0.666667  1.176471  0.833333  1.666667  1.724138   1.875
estern      True      True      True     False     False   False

In [30]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [35]:
obj.reindex(['a','b','c','d']) #this syntax used for reindexing the elements present in it. and it even used for filtering.

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [37]:
df1.reindex([2,1,3,4,0]) #even used in dataframes. it won't modify the old one but rather creates new one.

    state  year  pop  men       avg  estern
2    Ohio  2002  3.6    3  0.833333    True
1    Ohio  2001  1.7    2  1.176471    True
3  Nevada  2001  2.4    4  1.666667   False
4  Nevada  2002  2.9    5  1.724138   False
0    Ohio  2000  1.5    1  0.666667    True

In [40]:
ap = pd.Series(np.random.randint(3,size = 11), index = list('abcdefghijk'))
ap

a    1
b    2
c    0
d    2
e    1
f    2
g    0
h    0
i    0
j    0
k    1
dtype: int64

In [42]:
ap.drop('b')  #removing an index

a    1
c    0
d    2
e    1
f    2
g    0
h    0
i    0
j    0
k    1
dtype: int64

In [52]:
df1.drop(4) #again can be done in dataframs too.

    state  year  pop       avg  estern
0    Ohio  2000  1.5  0.666667    True
1    Ohio  2001  1.7  1.176471    True
2    Ohio  2002  3.6  0.833333    True
3  Nevada  2001  2.4  1.666667   False
5  Nevada  2003  3.2  1.875000   False

In [55]:
df1.drop(columns = ['avg'])
df1

    state  year  pop       avg  estern
0    Ohio  2000  1.5  0.666667    True
1    Ohio  2001  1.7  1.176471    True
2    Ohio  2002  3.6  0.833333    True
3  Nevada  2001  2.4  1.666667   False
4  Nevada  2002  2.9  1.724138   False
5  Nevada  2003  3.2  1.875000   False

In [61]:
df1.loc[[2,3,1,4,5,0]]# fancy indexing

    state  year  pop       avg  estern
2    Ohio  2002  3.6  0.833333    True
3  Nevada  2001  2.4  1.666667   False
1    Ohio  2001  1.7  1.176471    True
4  Nevada  2002  2.9  1.724138   False
5  Nevada  2003  3.2  1.875000   False
0    Ohio  2000  1.5  0.666667    True

In [62]:
df1['pop'] > 3

0    False
1    False
2     True
3    False
4    False
5     True
Name: pop, dtype: bool